import { NextResponse } from "next/server";

export type LikertOption = { value: number; label: string; description: string };

const likelihood: LikertOption[] = [
  {
    value: 1,
    label: "น้อยที่สุด",
    description:
      "หน่วยงานมีบุคลากรอยู่ปฏิบัติงานจริงเต็มตามกรอบอัตรากำลังและโดยไม่มีการปรับเปลี่ยน/โอน/ย้าย/ลาออกของบุคลากรที่ปฏิบัติงาน ภายในระยะเวลา 2 ปี",
  },
  {
    value: 2,
    label: "น้อย",
    description:
      "หน่วยงานมีบุคลากรอยู่ปฏิบัติงานจริงเต็มตามกรอบอัตรากำลังและโดยไม่มีการปรับเปลี่ยน/โอน/ย้าย/ลาออก ของบุคลากรที่ปฏิบัติงาน ภายในระยะเวลา 1 ปี",
  },
  {
    value: 3,
    label: "ปานกลาง",
    description:
      "หน่วยงานมีบุคลากรอยู่ปฏิบัติงานจริงเต็มตามกรอบอัตรากำลังและและไม่มีการปรับเปลี่ยน/โอน/ย้าย/ลาออกของบุคลากรที่ปฏิบัติงานในระหว่างปีงบประมาณ พ.ศ. 2567",
  },
  {
    value: 4,
    label: "มาก",
    description:
      "หน่วยงานมีบุคลากรอยู่ปฏิบัติงานจริงน้อยกว่าจำนวนบุคลากรตามกรอบอัตรากำลัง คิดเป็นร้อยละ 5",
  },
  {
    value: 5,
    label: "มากที่สุด",
    description:
      "หน่วยงานมีบุคลากรอยู่ปฏิบัติงานจริงน้อยกว่าจำนวนบุคลากรตามกรอบอัตรากำลัง คิดเป็นร้อยละ 10",
  },
];

// ถ้าต้องการให้ "ผลกระทบ" เป็นอีกชุด ก็แก้ที่นี่ได้
const impact: LikertOption[] = likelihood;

export async function GET() {
  return NextResponse.json({
    message: "OK",
    data: { likelihood, impact },
  });
}
